# Public Brewfile — generic dev tools. No version pins.
# Install: brew bundle --file=Brewfile
# TRIM what you don't want before committing.

# --- taps ---
tap "gabe565/tap"          # ansi2txt
tap "rtk-ai/tap"           # rtk

# === CLI core ===
brew "fish"
brew "tmux"
brew "neovim"
brew "stow"
brew "git-delta"           # delta pager (your gitconfig uses it)
brew "git-absorb"
brew "git-secrets"
brew "gh"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "jq"
brew "tree"
brew "wget"
brew "watch"
brew "parallel"
brew "direnv"
brew "pstree"
brew "rsync"

# === GNU coreutils / build ===
brew "coreutils"
brew "gnu-sed"
brew "gnu-time"
brew "findutils"
brew "grep"
brew "awk"
brew "shellcheck"
brew "pre-commit"

# === languages / runtimes (no pin) ===
brew "uv"
brew "rustup"

# === media / docs ===
brew "ffmpeg"
brew "graphviz"
brew "mdcat"
brew "ansi2txt"

# === misc ===
brew "sshpass"             # non-interactive ssh password auth (was internal)
brew "agent-browser"       # browser automation CLI for AI agents (was internal)
brew "rtk"                 # rtk-ai/tap

# === casks ===
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "font-fira-code-nerd-font"  # Terminal.app Material profile uses FiraCodeNF
cask "db-browser-for-sqlite"
cask "qlmarkdown"
